Revit 2024 API
BuiltInFailures.FamilyFailures.CircularRefsForInstParams Property
 "Instance parameter '%1!s!' generates circular references."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircularRefsForInstParams { get; }
Visual Basic
Public Shared ReadOnly Property CircularRefsForInstParams As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircularRefsForInstParams {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace